micropython/micropython/ports/raspberrypi/boards/challenger_nb_rp2040_wifi/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Challenger NB RP2040 WiFi"
#define MICROPY_HW_MCU_NAME "rp2040"

#define DEFAULT_UART_BUS_TX   (&pin_GPIO16)
#define DEFAULT_UART_BUS_RX   (&pin_GPIO17)
#define DEFAULT_I2C_BUS_SDA   (&pin_GPIO0)
#define DEFAULT_I2C_BUS_SCL   (&pin_GPIO1)
